refined readme and added a second vcf
